In [1]:
import numpy as np

import pandas as pd

In [4]:
pd.Series([1, 3, 5, np.nan, 6, 8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
pd.date_range('20130101', periods=6, freq="5Y")

DatetimeIndex(['2013-12-31', '2018-12-31', '2023-12-31', '2028-12-31',
               '2033-12-31', '2038-12-31'],
              dtype='datetime64[ns]', freq='5A-DEC')

In [13]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})

In [14]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [16]:
type(df2.dtypes)

pandas.core.series.Series

In [19]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [22]:
df = pd.DataFrame(np.random.randint(10, 20, (5, 6)))

In [32]:
df

    0   1   2   3   4   5
0  16  12  11  11  14  16
1  14  18  19  18  11  12
2  14  14  10  14  14  16
3  12  18  10  12  18  10
4  16  19  11  19  18  17

In [28]:
df.sort_index(axis=1, ascending=False)

    5   4   3   2   1   0
0  16  14  11  11  12  16
1  12  11  18  19  18  14
2  16  14  14  10  14  14
3  10  18  12  10  18  12
4  17  18  19  11  19  16

In [34]:
df.sort_values([2])

    0   1   2   3   4   5
2  14  14  10  14  14  16
3  12  18  10  12  18  10
0  16  12  11  11  14  16
4  16  19  11  19  18  17
1  14  18  19  18  11  12

In [31]:
df

    0   1   2   3   4   5
0  16  12  11  11  14  16
1  14  18  19  18  11  12
2  14  14  10  14  14  16
3  12  18  10  12  18  10
4  16  19  11  19  18  17

In [36]:
df[2:5]

    0   1   2   3   4   5
2  14  14  10  14  14  16
3  12  18  10  12  18  10
4  16  19  11  19  18  17

In [42]:
df.loc[2:3, 3:5]

    3   4   5
2  14  14  16
3  12  18  10

In [100]:
data = np.random.randint(10, 20, (4, 4))
df = pd.DataFrame(data, index=list("ABCD"), columns=list("WXYZ"))

In [49]:
df

    W   X   Y   Z
A  10  13  19  19
B  18  14  19  17
C  16  14  19  14
D  19  13  17  10

In [52]:
df.loc["A":"B", "W":"Y"]

    W   X   Y
A  10  13  19
B  18  14  19

In [54]:
df.loc[[True, True, False, False]]

    W   X   Y   Z
A  10  13  19  19
B  18  14  19  17

In [61]:
df["X"] > 13

df.loc[df["X"] > 13, df.loc["B"] < 18]

    X   Z
B  14  17
C  14  14

In [68]:
df.iloc[[1, 3, 2, 1, 0, 0, 1], ]

    W   X   Y   Z
B  18  14  19  17
D  19  13  17  10
C  16  14  19  14
B  18  14  19  17
A  10  13  19  19
A  10  13  19  19
B  18  14  19  17

In [78]:
df.iloc[:2, :3] = [12, 34, 11]

In [86]:
df.prod(axis=1)

A    85272
B    76296
C    59584
D    41990
dtype: int64

In [103]:
df

    W   X   Y   Z
A  18  18  17  19
B  17  16  14  12
C  10  19  19  17
D  13  16  14  19

In [104]:
def work(ser):
    temp = ser.copy()
    temp.iloc[0] = sum(temp.iloc[:2])
    return temp

d = df.apply(work, axis=1)

In [106]:
df

    W   X   Y   Z
A  18  18  17  19
B  17  16  14  12
C  10  19  19  17
D  13  16  14  19